app/controllers/api/v1/postcards_controller.rb

  def index
    postcards_per_page = 8
    @postcards = Postcard.order(created_at: :desc)
    paginated_postcards = paginate_postcards(@postcards, postcards_per_page)
    total_postcards_count = @postcards.count
---
SELECT "postcards".* FROM "postcards" ORDER BY "postcards"."created_at" DESC
SELECT COUNT(*) FROM "postcards"

  def create
    postcard = Postcard.create!(postcard_params)
---
INSERT INTO "postcards" ("title", "author", "year", "color", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @postcard&.destroy
---
DELETE FROM "postcards" WHERE "postcards"."id" = $1  [["id", 9]]

  def set_postcard
    @postcard = Postcard.find(params[:id])
---
SELECT "postcards".* FROM "postcards" WHERE "postcards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]