app/controllers/api/v1/search_controller.rb

  def postcards
    # Calling the reusable scope defined in the model
    postcards_per_page = 2
    @postcards = Postcard.search_by_keywords(params[:q])
    paginated_postcards = paginate_postcards(@postcards, postcards_per_page)
    total_postcards_count = @postcards.count
---
SELECT COUNT(*) FROM "postcards" WHERE (title ILIKE $1 OR author ILIKE $2 OR year ILIKE $3)  [[nil, "%marko%"], [nil, "%marko%"], [nil, "%marko%"]]